In [14]:
from platform import python_version
print(python_version())

3.8.5

In [15]:
from sqlalchemy import create_engine
import pandas as pd

In [16]:
SERVER = 'LAPTOP-LKTQIML4\MSSQL2019'
DATABASE = 'exampleDB'
DRIVER = 'SQL Server Native Client 11.0'
USERNAME = 'sa'
PASSWORD = 'Instance12'
DATABASE_CONNECTION = f'mssql://{USERNAME}:{PASSWORD}@{SERVER}/{DATABASE}?driver={DRIVER}'

In [17]:
engine = create_engine(DATABASE_CONNECTION)
connection = engine.connect()

In [18]:
data = pd.read_sql_query("select  * from Employee order by Id asc ", connection)

In [19]:
data.dtypes

Id               int64
EmployeeName    object
Address         object
Gender          object
Salary           int64
dtype: object

In [20]:
data

   Id EmployeeName     Address Gender  Salary
0   1       Sailor       Texas      M  900000
1   2       Dustin     Indiana      M  800000
2   3        Cindy  California      F  700000
3   4         John     Florida      M  700000
4   5      Jessica     Florida      F  500000

In [21]:
data.iloc[0,2]="Washington"
data.iloc[0,4]=data.iloc[0,4]+100000

In [22]:
data

   Id EmployeeName     Address Gender   Salary
0   1       Sailor  Washington      M  1000000
1   2       Dustin     Indiana      M   800000
2   3        Cindy  California      F   700000
3   4         John     Florida      M   700000
4   5      Jessica     Florida      F   500000